"""ЗАДАЧА  На столе лежат n монеток. Некоторые из них лежат вверх решкой, а некоторые – гербом. Определите минимальное число монеток, которые нужно перевернуть,
чтобы все монетки были повернуты вверх одной и той же стороной. Выведите минимальное количество монет, которые нужно перевернуть """

"""import random
n=int(input("Введите количество монет: "))
count0=0
count1=0
list1=()
for i in range(n):
    list1=random.randint(0,1)
    print.join(list1)
    if i ==1:
        count1+=1
    elif i ==0:
        count0+=1
if count0>count1:
    print (f"Перевернуто больше вверх решкой = : {count0}")
 
else:
     print (f"Перевернуто больше вверх гербом : {count1}") """

"""Задача 12: Петя и Катя – брат и сестра. Петя – студент, а Катя – школьница. Петя помогает Кате по математике. Он задумывает два натуральных числа X и Y (X,Y≤1000),
 а Катя должна их отгадать. Для этого Петя делает две подсказки. Он называет сумму этих чисел S и их произведение P. Помогите Кате отгадать задуманные Петей числа"""


"""Задача 14: Требуется вывести все целые степени двойки (т.е. числа вида 2k), не превосходящие числа N."""
"""n=int(input("Введите n: "))
list1=[]
list1=[(2**i) for i in range(2,n) if 2**i <=n ] 
print(list1)"""
